const S = require('../if-07.js');

QUnit.test("ЗАДАЧА 07. S(x1, y1, x2, y2, x3, y3)", 
  function(assert){
	assert.deepEqual(S(0, 0, 2, 0, 0, -2), 2, "Не выполнено S(0, 0, 2, 0, 0, -2) === 2");
	assert.deepEqual(S(3, 0, 6, -4, 0, -4), 12, "Не выполнено S(3, 0, 6, -4, 0, -4) === 12");
	assert.deepEqual(S(0, 0, 0, 0, 0, 0), -1, "Не выполнено S(0, 0, 0, 0, 0, 0) === -1");
	assert.deepEqual(S(2, 1.732, 1, 0, 0, 1.732), 1.7319999999999998, "Не выполнено S(2, 1.732, 1, 0, 0, 1.732) === 1.732"); //равносторонний треугольник
	assert.deepEqual(S(4, 8, 16, 0, 4, 0), -1, "Не выполнено S(4, 8, 16, 0, 4, 0) === -1");
	assert.deepEqual(S(0,0, 1,1, 2,2), -1, "Не выполнено S(4, 8, 16, 0, 4, 0) === -1"); // диагональ
	assert.deepEqual(S(0,0, -2,2, -4,4), -1, "Не выполнено S(0,0, -2,2, -4,4) === -1"); // обратная диагональ

  }
);
