const f = require('../if-08.js');

QUnit.test("ЗАДАЧА 08. f(x1,y1,x2,y2,x3,y3) = Площадь треугольника в противном случае -1", 
  function(assert){
	assert.deepEqual(f(1, 1, 1, 1, 1, 1), -1, "Не выполнено f(1, 1, 1, 1, 1, 1) === -1");
	assert.deepEqual(f(1, 2, 4, 3, 5, 6), -1, "Не выполнено f(1, 2, 4, 3, 5, 6) === -1");
	assert.deepEqual(f(1, 3, 2, 3, 2, 1), -1, "Не выполнено f(1, 3, 2, 3, 2, 1) === -1");
	assert.deepEqual(f(3, 2, 1, 3, 2, 1), 2.5000000000000004, "Не выполнено f(3, 2, 1, 3, 2, 1) === 2.5000000000000004");
  }
);
