const f = require('../if-07.js');

QUnit.test("ЗАДАЧА 07. S(x1,y1, x2,y2, x3,y3) если это вершины равнобедренного треугольника, то функция даёт его площадь", function(assert){
	assert.deepEqual(f(1,1, 1,3, 3,3), 1.9999999999999993, "-1 Не выполнено")
	assert.deepEqual(f(1,1, 4,4, 7,1), 8.999999999999998, "-1 Не выполнено")
	assert.deepEqual(f(1,0, 2,4, 3,0), 4, "-1 Не выполнено")
	assert.deepEqual(f(-1,-1, -1,-3, -3,-3), 1.9999999999999993, "-1 Не выполнено")
	assert.deepEqual(f(-1,-1, -4,-4, -7,-1), 8.999999999999998, "-1 Не выполнено")
	assert.deepEqual(f(-1,-0, -2,-4, -3,-0), 4, "-1 Не выполнено")
	assert.deepEqual(f(0,0, 0,0, 0,0, 0,0), 0, "-1 Не выполнено")
});
