const [X4, Y4] = require('../if-14.js');

QUnit.test("ЗАДАЧА 14. X4(x1, y1, x2, y2, x3, y3) и Y4(x1, y1, x2, y2, x3, y3)", 
  function(assert){
	assert.deepEqual(X4(0, 0, 4, 0, 4, 2), 0, "Не выполнено X4(0, 0, 4, 0, 4, 2) === 0");
	assert.deepEqual(Y4(0, 0, 4, 0, 4, 2), 2, "Не выполнено Y4(0, 0, 4, 0, 4, 2) === 2");

	assert.deepEqual(X4(0, 0, 3, -3, 1, -5), -2, "Не выполнено X4(0, 0, 3, -3, 1, -5) === -2"); //прямоугольник, стоящий под углом
	assert.deepEqual(Y4(0, 0, 3, -3, 1, -5), -2, "Не выполнено X4(0, 0, 3, -3, 1, -5) === -2");

	assert.deepEqual(X4(0, 0, 8, 0, 0, -3), 8, "Не выполнено X4(0, 0, 8, 0, 0, -3) === 8"); //координатные точки, не идущие последовательно
	assert.deepEqual(Y4(0, 0, 8, 0, 0, -3), -3, "Не выполнено Y4(0, 0, 8, 0, 0, -3) === -3");

	assert.deepEqual(X4(0, 0, 0, 0, 0, 0), "Ошибка", "Не выполнено X4(0, 0, 0, 0, 0, 0) === Ошибка");
	assert.deepEqual(Y4(0, 0, 0, 0, 0, 0), "Ошибка", "Не выполнено Y4(0, 0, 0, 0, 0, 0) === Ошибка");

	assert.deepEqual(X4(0, 2, 0, 2, 0, 4), "Ошибка", "Не выполнено X4(0, 2, 0, 2, 0, 4) === Ошибка");
	assert.deepEqual(Y4(0, 2, 0, 2, 0, 4), "Ошибка", "Не выполнено Y4(0, 2, 0, 2, 0, 4) === Ошибка");

	assert.deepEqual(X4(5, 2, 2, 5, 9, 6), 6, "Не выполнено X4(5, 2, 2, 5, 9, 6) === 6");
	assert.deepEqual(Y4(5, 2, 2, 5, 9, 6), 9, "Не выполнено Y4(5, 2, 2, 5, 9, 6) === 9");

	assert.deepEqual(X4(0,0, -2,2, -4,4), "Ошибка", "Не выполнено X4(0,0, -2,2, -4,4) === Ошибка"); // диагональ
	assert.deepEqual(Y4(0,0, -2,2, -4,4), "Ошибка", "Не выполнено Y4(0,0, -2,2, -4,4) === Ошибка");

	assert.deepEqual(X4(5,2, 2,5, 6,9), 9, "Не выполнено X4(5,2, 2,5, 6,9) === 9");
	assert.deepEqual(Y4(5,2, 2,5, 6,9), 6, "Не выполнено Y4(5,2, 2,5, 6,9) === 6");

  }
);