const f = require('../if-13.js');

QUnit.test("ЗАДАЧА 13. Напишите функцию S(x1,y1,x2,y2,x3,y3), которая принимает координаты трёх точек (xi,yi), i=1, 2, 3 на плоскости, и дает true, если эти точки являются тремя различными вершинами некоторого квадрата(влюбом порядке), впротивном случае дает false", 
  function(assert){
	assert.deepEqual(f(0, 0, 0, 0, 0, 0), false, "Не выполнено f(0, 0, 0, 0, 0, 0) === false");
	assert.deepEqual(f(-5, 0, -5, 5, 0, 5), true, "Не выполнено f(-5, 0, -5, 5, 0, 5) === true");
	assert.deepEqual(f(10, 10, 0, 10, 0, 0), true, "Не выполнено f(0, 0, 0, 0, 0, 0) === true");
	assert.deepEqual(f(0, 0, 0, 1, 0, 1), false, "Не выполнено f(0, 0, 0, 0, 0, 0) === false");
	assert.deepEqual(f(113, 45, 7, 1000, -89, 0), false, "Не выполнено f(0, 0, 0, 0, 0, 0) === false");
	assert.deepEqual(f(7, 0, 7, 7, 0, 7), true, "Не выполнено f(0, 0, 0, 0, 0, 0) === true");
	assert.deepEqual(f(0, 1, 1, 0, 1, 1), true, "Не выполнено f(0, 0, 0, 0, 0, 0) === true");
  }
);
